[
    {
      "description" : "Advocate for survivors of sexual assault and bring awareness to the issue.",
      "eliminated" : false,
      "name" : "Preventing Sexual Assault",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We are a debate club based upon inspiring the next generation of world leaders to solve world issues through diplomacy and compromise. We compete in competitions each semester to reinforce our educational ideals and build professional skills.",
      "eliminated" : false,
      "name" : "Model United Nations",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We are a student run athletic club that welcomes all girls who are interested in playing my hockey. We have a wide range of talent on the team and practice twice a week with typically two games on the weekends.",
      "eliminated" : false,
      "name" : "Women’s Ice Hockey",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We represent the Republican Party here on campus. We bring in speakers, host socials, and campaign during election years.",
      "eliminated" : false,
      "name" : "College Republicans",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "Bengali Student Association was established in order to promote cultural awareness of Bangladesh's traditions. We are determined to contribute to diversity within the university and provide service to the community.",
      "eliminated" : false,
      "name" : "Bengali Student Association",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "Turkish Student Organization is a non-religious and cultural club. Our organization is open to those who are interested in learning about the history and traditions of Turkey.",
      "eliminated" : false,
      "name" : "Turkish Student Organiztion",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "This chapter of the international English honors society hosts social, academic, and philanthropic programming related to English language and literature.  We are best known for our literary-inspired movie nights hosted in Tawes at least once a month.",
      "eliminated" : false,
      "name" : "Sigma Tau Delta",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We are an inclusive gaming community that focuses on both the casual and competitive side of Esports. We host big LAN parties each semester for the community and we send out multiple teams to national tournaments.",
      "eliminated" : false,
      "name" : "UMCP Gaming",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We work to create a space where women can empower each other to run for elected office.",
      "eliminated" : false,
      "name" : "IGNITE at Maryland",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We compete against the best sailing teams on the east coast, sail leisurely in Annapolis and spread our knowledge and love of sailing to anyone who wants to learn.",
      "eliminated" : false,
      "name" : "Maryland Sailing Team",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "MasTERPiece! seeks to provide a platform for fashion entrepreneurs and other artists who are interested in pursuing a career in the retail industry. Through our engagement in community service, networking, and professional development, we strive to promote individualism amongst our stylish students.",
      "eliminated" : false,
      "name" : "MasTERPiece",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "The Biomedical Engineering Society (BMES) promotes professional development within the bioengineering field (though it is open to all majors) and promotes engineering community spirit and outreach activities. Our main activities include guest speakers, lab tours, competition efforts, semester blood drives, elementary and high school Empowering STEM leader days, and social/community events. ",
      "eliminated" : false,
      "name" : "Biomedical Engineering Society",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "UMD Pride Alliance exists to provide a safe and supportive environment for LGBTQ+ students within the University of Maryland, College Park community through community building, community advocacy, and cross-cultural education.",
      "eliminated" : false,
      "name" : "Pride Alliance",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We've been tossing around discs since 93'.",
      "eliminated" : false,
      "name" : "Men's Club Ultimate Frisbee",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "The University Student Judiciary (USJ) is one of Maryland's premier student governance organizations, whose members help the campus community by educating students about and holding students accountable to the policies of the University of Maryland. The members of USJ also are responsible for promoting integrity, character, and ethics within the campus community.",
      "eliminated" : false,
      "name" : "University Student Judiciary",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "SASE is dedicated to the advancement of Asian heritage scientists and engineers in education and employment so that they can achieve their full career potential. In addition to professional development, SASE also encourages members to contribute to the enhancement of the communities in which they live.",
      "eliminated" : false,
      "name" : "Society of Asian Scientists and Engineers",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "MaryPIRG is a student led advocacy and community service organization established at the University of Maryland in 1973. MaryPIRG is a non-partisan organization that does not endorse or support any political party or political candidate. MaryPIRG aims to facilitate student involvement in political and service initiatives, including environmental, consumer protection, and higher education issues.",
      "eliminated" : false,
      "name" : "MaryPIRG",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "The pinnacle of fraternal and professional societies, centered on the potential of each brother, the unquenchable thirst for personal development and the lifelong values of friendship, sound learning and rectitude.",
      "eliminated" : false,
      "name" : "Phi Delta Theta",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We represent the Divine Nine organizations on our campus. Formed in 1930, we oversee all nine predominantly Black fraternities and Sororities.",
      "eliminated" : false,
      "name" : "National Pan-Hellenic Council",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "Sigma Delta Tau is a national Panhellenic sorority committed to empowering women! Our chapter works toward raising money for our philanthropies, promoting scholarship and enabling women to become strong leaders.",
      "eliminated" : false,
      "name" : "Sigma Delta Tau",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We work with at-risk kids from schools in the area to foster ideas of higher education, culture and diversity, and community service through engaging activities. We want all school kids to look forward sooner and be able to give back later.",
      "eliminated" : false,
      "name" : "College Mentors for Kids",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We are a fraternity dedicated to building balanced men. Part of the proceeds will be donated to the UMD Neonatal intensive care unit.",
      "eliminated" : false,
      "name" : "SigEp",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "Founded in 1978, the Vietnamese Student Association at the University of Maryland, College Park serves as an educational and social voice for the Vietnamese American community both on campus and in the Washington DC Metropolitan area. Throughout the year, VSA hosts many social and cultural events that promote culture, team bonding, and personal development for students from all backgrounds and cultures!",
      "eliminated" : false,
      "name" : "Vietnamese Student Association (VSA)",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We are pre-professional organization whose mission is to recruit, retain, and release qualified minorities in the fields of computer science, engineering, mathematics, and physical sciences. We offer an immense amount of resources and support systems to our membership including weekly study sessions, professional development workshops, and networking opportunities.",
      "eliminated" : false,
      "name" : "Black Engineers Society",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We are an organization helping kids whose parents are affected by cancer, providing them a free, weeklong summer camp to build friendships and support each other. We do all of the fundraising and they just come to camp to have fun!",
      "eliminated" : false,
      "name" : "Camp Kesem",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "Kappa Alpha Psi is one of 9 historically distinguished African American Greek lettered organizations. Our motto is achievement in every field of human endeavor and we strive to promote the success of African American people.",
      "eliminated" : false,
      "name" : "Kappa Alpha Psi Fraternity Incorporated",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We are a group of individuals who pride themselves on striving to be better men in the community, in the classroom, and in our philanthropic endeavors. Last year we won the presidents cup for our achievements on campus and even after that we strive to be greater.",
      "eliminated" : false,
      "name" : "The Delta Sigma Phi Fraternity",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We are a Greek letter social fraternity.",
      "eliminated" : false,
      "name" : "Sigma Alpha Epsilon",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We are a club dedicated to promoting economics and helping students with career advice, course advice, and information related to economics.",
      "eliminated" : false,
      "name" : "The Economics Association of Maryland",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "As the first sorority ever created to cater towards the needs of Latinas in the nation, we strive to develop strong leaders who will make a difference in their communities by providing political, cultural, and social events. We are Latin by tradition, not by definition and although our roots are Latin, we have sisters from various cultures, nationalities and races.",
      "eliminated" : false,
      "name" : "Lambda Theta Alpha Latin Sorority, Inc.",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We are a sorority here at the University of Maryland, the Delta Xi Chapter. We are dedicated to our sisterhood and service, dedicating much our time to our three national philanthropies.",
      "eliminated" : false,
      "name" : "Delta Phi Epsilon",
      "competitor": " ",
      "votes": 0
    },
    {
      "description" : "We are a housing justice co-operative that operates as an independent intermediary between our members as tenants and their landlords. Our intentional community includes 5 houses across College Park, and is a safe space that provides an alternative living environment to dorms or apartment-style living.",
      "eliminated" : false,
      "name" : "Co-op Housing University of Maryland (CHUM)",
      "competitor": " ",
      "votes": 0
    }
]
